; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob14) (:domain depot)
(:objects
	depot0 - depot
	distributor0 distributor1 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 - crate
	hoist0 hoist1 hoist2 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate7)
	(at pallet1 distributor0)
	(clear crate10)
	(at pallet2 distributor1)
	(clear crate8)
	(at truck0 distributor0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 320)
	(at truck1 distributor0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 238)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at hoist2 distributor1)
	(available hoist2)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(= (weight crate0) 15)
	(at crate1 depot0)
	(on crate1 pallet0)
	(= (weight crate1) 86)
	(at crate2 distributor1)
	(on crate2 pallet2)
	(= (weight crate2) 71)
	(at crate3 distributor1)
	(on crate3 crate2)
	(= (weight crate3) 52)
	(at crate4 distributor1)
	(on crate4 crate3)
	(= (weight crate4) 6)
	(at crate5 depot0)
	(on crate5 crate1)
	(= (weight crate5) 17)
	(at crate6 depot0)
	(on crate6 crate5)
	(= (weight crate6) 31)
	(at crate7 depot0)
	(on crate7 crate6)
	(= (weight crate7) 71)
	(at crate8 distributor1)
	(on crate8 crate4)
	(= (weight crate8) 85)
	(at crate9 distributor0)
	(on crate9 crate0)
	(= (weight crate9) 78)
	(at crate10 distributor0)
	(on crate10 crate9)
	(= (weight crate10) 100)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate5)
		(on crate1 crate0)
		(on crate2 pallet2)
		(on crate3 crate2)
		(on crate4 crate3)
		(on crate5 crate7)
		(on crate6 crate1)
		(on crate7 pallet0)
		(on crate8 crate10)
		(on crate9 pallet1)
		(on crate10 crate9)
	)
)

(:metric minimize (fuel-cost)))

; plan
1. (lift hoist0 crate7 crate6 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate6)
   added: (lifting hoist0 crate7) (clear crate6)
   changed: (fuel-cost) from 0 to 1
   goals met: 4 of 11
2. (lift hoist2 crate8 crate4 distributor1)
   deleted: (at crate8 distributor1) (clear crate8) (available hoist2) (on crate8 crate4)
   added: (lifting hoist2 crate8) (clear crate4)
   changed: (fuel-cost) from 1 to 2
   goals met: 4 of 11
3. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 2 to 12
   goals met: 4 of 11
4. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 71
   goals met: 4 of 11
5. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 12 to 22
   goals met: 4 of 11
6. (lift hoist0 crate6 crate5 depot0)
   deleted: (at crate6 depot0) (clear crate6) (available hoist0) (on crate6 crate5)
   added: (lifting hoist0 crate6) (clear crate5)
   changed: (fuel-cost) from 22 to 23
   goals met: 4 of 11
7. (load hoist0 crate6 truck0 depot0)
   deleted: (lifting hoist0 crate6)
   added: (in crate6 truck0) (available hoist0)
   changed: (current_load truck0) from 71 to 102
   goals met: 4 of 11
8. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 23 to 33
   goals met: 4 of 11
9. (lift hoist1 crate10 crate9 distributor0)
   deleted: (at crate10 distributor0) (clear crate10) (available hoist1) (on crate10 crate9)
   added: (lifting hoist1 crate10) (clear crate9)
   changed: (fuel-cost) from 33 to 34
   goals met: 3 of 11
10. (drive truck1 distributor0 distributor1)
   deleted: (at truck1 distributor0)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 34 to 44
   goals met: 3 of 11
11. (lift hoist0 crate5 crate1 depot0)
   deleted: (at crate5 depot0) (clear crate5) (available hoist0) (on crate5 crate1)
   added: (lifting hoist0 crate5) (clear crate1)
   changed: (fuel-cost) from 44 to 45
   goals met: 3 of 11
12. (load hoist2 crate8 truck1 distributor1)
   deleted: (lifting hoist2 crate8)
   added: (in crate8 truck1) (available hoist2)
   changed: (current_load truck1) from 0 to 85
   goals met: 3 of 11
13. (drive truck1 distributor1 depot0)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 45 to 55
   goals met: 3 of 11
14. (load hoist0 crate5 truck0 depot0)
   deleted: (lifting hoist0 crate5)
   added: (in crate5 truck0) (available hoist0)
   changed: (current_load truck0) from 102 to 119
   goals met: 3 of 11
15. (lift hoist0 crate1 pallet0 depot0)
   deleted: (at crate1 depot0) (clear crate1) (available hoist0) (on crate1 pallet0)
   added: (lifting hoist0 crate1) (clear pallet0)
   changed: (fuel-cost) from 55 to 56
   goals met: 3 of 11
16. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 56 to 66
   goals met: 3 of 11
17. (load hoist1 crate10 truck1 distributor0)
   deleted: (lifting hoist1 crate10)
   added: (in crate10 truck1) (available hoist1)
   changed: (current_load truck1) from 85 to 185
   goals met: 3 of 11
18. (lift hoist1 crate9 crate0 distributor0)
   deleted: (at crate9 distributor0) (clear crate9) (available hoist1) (on crate9 crate0)
   added: (lifting hoist1 crate9) (clear crate0)
   changed: (fuel-cost) from 66 to 67
   goals met: 3 of 11
19. (drive truck1 distributor0 depot0)
   deleted: (at truck1 distributor0)
   added: (at truck1 depot0)
   changed: (fuel-cost) from 67 to 77
   goals met: 3 of 11
20. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   changed: (current_load truck0) from 119 to 205
   goals met: 3 of 11
21. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 77 to 87
   goals met: 3 of 11
22. (drive truck1 depot0 distributor0)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor0)
   changed: (fuel-cost) from 87 to 97
   goals met: 3 of 11
23. (load hoist1 crate9 truck0 distributor0)
   deleted: (lifting hoist1 crate9)
   added: (in crate9 truck0) (available hoist1)
   changed: (current_load truck0) from 205 to 283
   goals met: 3 of 11
24. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist1) (on crate0 pallet1)
   added: (lifting hoist1 crate0) (clear pallet1)
   changed: (fuel-cost) from 97 to 98
   goals met: 3 of 11
25. (load hoist1 crate0 truck0 distributor0)
   deleted: (lifting hoist1 crate0)
   added: (in crate0 truck0) (available hoist1)
   changed: (current_load truck0) from 283 to 298
   goals met: 3 of 11
26. (unload hoist1 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist1)
   added: (lifting hoist1 crate9)
   changed: (current_load truck0) from 298 to 220
   goals met: 3 of 11
27. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 98 to 108
   goals met: 3 of 11
28. (drop hoist1 crate9 pallet1 distributor0)
   deleted: (lifting hoist1 crate9) (clear pallet1)
   added: (available hoist1) (at crate9 distributor0) (clear crate9) (on crate9 pallet1)
   goals met: 4 of 11
29. (unload hoist1 crate10 truck1 distributor0)
   deleted: (in crate10 truck1) (available hoist1)
   added: (lifting hoist1 crate10)
   changed: (current_load truck1) from 185 to 85
   goals met: 4 of 11
30. (unload hoist0 crate7 truck0 depot0)
   deleted: (in crate7 truck0) (available hoist0)
   added: (lifting hoist0 crate7)
   changed: (current_load truck0) from 220 to 149
   goals met: 4 of 11
31. (drop hoist0 crate7 pallet0 depot0)
   deleted: (lifting hoist0 crate7) (clear pallet0)
   added: (available hoist0) (at crate7 depot0) (clear crate7) (on crate7 pallet0)
   goals met: 5 of 11
32. (unload hoist0 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist0)
   added: (lifting hoist0 crate5)
   changed: (current_load truck0) from 149 to 132
   goals met: 5 of 11
33. (drop hoist0 crate5 crate7 depot0)
   deleted: (lifting hoist0 crate5) (clear crate7)
   added: (available hoist0) (at crate5 depot0) (clear crate5) (on crate5 crate7)
   goals met: 6 of 11
34. (unload hoist0 crate0 truck0 depot0)
   deleted: (in crate0 truck0) (available hoist0)
   added: (lifting hoist0 crate0)
   changed: (current_load truck0) from 132 to 117
   goals met: 6 of 11
35. (drop hoist0 crate0 crate5 depot0)
   deleted: (lifting hoist0 crate0) (clear crate5)
   added: (available hoist0) (at crate0 depot0) (clear crate0) (on crate0 crate5)
   goals met: 7 of 11
36. (drop hoist1 crate10 crate9 distributor0)
   deleted: (lifting hoist1 crate10) (clear crate9)
   added: (available hoist1) (at crate10 distributor0) (clear crate10) (on crate10 crate9)
   goals met: 8 of 11
37. (unload hoist0 crate1 truck0 depot0)
   deleted: (in crate1 truck0) (available hoist0)
   added: (lifting hoist0 crate1)
   changed: (current_load truck0) from 117 to 31
   goals met: 8 of 11
38. (unload hoist1 crate8 truck1 distributor0)
   deleted: (in crate8 truck1) (available hoist1)
   added: (lifting hoist1 crate8)
   changed: (current_load truck1) from 85 to 0
   goals met: 8 of 11
39. (drop hoist1 crate8 crate10 distributor0)
   deleted: (lifting hoist1 crate8) (clear crate10)
   added: (available hoist1) (at crate8 distributor0) (clear crate8) (on crate8 crate10)
   goals met: 9 of 11
40. (drop hoist0 crate1 crate0 depot0)
   deleted: (lifting hoist0 crate1) (clear crate0)
   added: (available hoist0) (at crate1 depot0) (clear crate1) (on crate1 crate0)
   goals met: 10 of 11
41. (unload hoist0 crate6 truck0 depot0)
   deleted: (in crate6 truck0) (available hoist0)
   added: (lifting hoist0 crate6)
   changed: (current_load truck0) from 31 to 0
   goals met: 10 of 11
42. (drop hoist0 crate6 crate1 depot0)
   deleted: (lifting hoist0 crate6) (clear crate1)
   added: (available hoist0) (at crate6 depot0) (clear crate6) (on crate6 crate1)
   goals met: 11 of 11
